{
  "termsTitle": "Termos e Condições",
  "termsLastUpdate": "Última atualização: Fevereiro 2026",
  "termsIntro1": "As presentes condições gerais definem os termos sob os quais um usuário utiliza o site PlaySignal.io (doravante \"PlaySignal\" ou \"o Site\").",
  "termsIntro2": "O Site é editado pela East Side Ltd, com sede em 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registrada em Malta sob o número C74040, CNPJ/IVA MT23084935.",
  "termsIntro3": "O atendimento ao cliente pode ser contatado por e-mail em customercare@easyside.agency para qualquer solicitação de assistência ou reclamação.",
  "termsIntro4": "Pedimos que leia atentamente as presentes condições gerais de uso. O uso do serviço implica a aceitação das presentes condições. O usuário concorda ainda em utilizar nossos serviços em total conformidade com as leis do seu país de residência.",
  "termsS1Title": "1. Descrição dos serviços",
  "termsS1P1": "O PlaySignal é um site que disponibiliza ao público informações, análises e comparações relativas às odds de apostas esportivas, partidas e previsões. O serviço inclui funcionalidades típicas deste tipo de plataforma informativa.",
  "termsS1P2": "O PlaySignal reserva-se o direito de modificar a qualquer momento as funcionalidades do serviço ou eliminá-las quando considerar apropriado. O Site pode conter links para conteúdos externos geridos por terceiros fora do nosso controle. O PlaySignal não assume responsabilidade de qualquer tipo em relação a conteúdos, informações, produtos e serviços oferecidos pelos sites acessíveis através de links externos.",
  "termsS2Title": "2. Natureza informativa do serviço",
  "termsS2P1": "O PlaySignal é um serviço de informação esportiva. Não oferece jogos de azar nem gerencia apostas. No Brasil, as apostas de quota fixa são reguladas pela Lei nº 13.756/2018 (apostas esportivas). O jogo e as apostas são proibidos para menores de 18 anos, em conformidade com a legislação aplicável. As informações fornecidas não constituem em nenhum caso aconselhamento ou recomendação de qualquer natureza. O uso dos conteúdos e informações disponíveis no PlaySignal é de exclusiva responsabilidade do usuário.",
  "termsS3Title": "3. Duração e utilização do serviço",
  "termsS3P1": "O serviço é fornecido sem limite de duração. Dada a gratuidade do serviço, o usuário pode encerrar a utilização a qualquer momento. O PlaySignal reserva-se o direito de suspender ou encerrar o serviço a qualquer momento, com ou sem aviso prévio.",
  "termsS3P2": "Em caso de descumprimento das presentes condições ou por qualquer outra razão legítima, o PlaySignal pode suspender o acesso ao serviço imediatamente e sem aviso prévio.",
  "termsS4Title": "4. Limitação de responsabilidade",
  "termsS4P1": "As informações divulgadas através do serviço são fornecidas sem qualquer garantia de confiabilidade, correção ou exaustividade. O serviço é fornecido \"como está\". O PlaySignal não pode ser considerado responsável por perdas ou danos decorrentes do uso do Site, de links externos, de falhas técnicas, de força maior ou de ações de terceiros.",
  "termsS5Title": "5. Dados pessoais",
  "termsS5P1": "Quanto ao tratamento de dados pessoais, remetemos à Política de Privacidade. O usuário dispõe a qualquer momento do direito de acesso, retificação e exclusão dos seus dados, contactando o atendimento ao cliente ou o Data Protection Officer no endereço indicado na política de privacidade.",
  "termsS6Title": "6. Uso permitido",
  "termsS6P1": "É autorizado apenas o uso pessoal e não comercial do serviço. É proibido publicar, reproduzir ou redistribuir os conteúdos do Site sem autorização. O usuário compromete-se a não publicar conteúdos ilícitos, difamatórios, discriminatórios ou em violação dos direitos de terceiros.",
  "termsS7Title": "7. Alterações",
  "termsS7P1": "O PlaySignal é livre para modificar as presentes condições a qualquer momento. A continuação da utilização do serviço após eventuais alterações vale como aceitação dos termos atualizados. Recomendamos consultar esta página periodicamente.",
  "termsS8Title": "8. Lei aplicável",
  "termsS8P1": "As presentes condições estão sujeitas à lei maltesa. Para qualquer litígio, será competente o foro de Malta, salvo disposições inderrogáveis em favor do consumidor.",
  "termsS9Title": "9. Jogo responsável",
  "termsS9P1": "O jogo e as apostas podem causar dependência. No Brasil, o jogo d'azzardo e as apostas esportivas (Lei nº 13.756/2018) são proibidos para menores de 18 anos. O art. 33 da referida lei estabelece práticas de responsabilidade social para a publicidade de apostas. Em caso de problemas relacionados ao jogo, recomenda-se contatar o Ministério da Saúde (Disque Saúde 136) ou visitar sites dedicados ao jogo responsável.",
  "termsFooter": "O jogo é proibido para menores de 18 anos. O jogo pode causar dependência.",
  "termsPrivacyLink": "Política de Privacidade",
  "termsCookieLink": "Configurações de cookies",
  "privacyTitle": "Política de Privacidade",
  "privacyLastUpdate": "Última atualização: Fevereiro 2026",
  "privacyIntro1": "A presente Política de Privacidade descreve como a East Side Ltd (doravante \"PlaySignal\", \"nós\" ou \"o Titular\") coleta, utiliza e protege os dados pessoais dos usuários do site PlaySignal.io. A presente Política aplica-se em adição aos nossos Termos e Condições.",
  "privacyIntro2": "Titular do tratamento: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registro: C74040, IVA: MT23084935.",
  "privacyIntro3": "Contatos: para solicitações sobre este documento ou nossas práticas de privacidade, contacte-nos em customercare@easyside.agency. Para questões relativas à proteção de dados pessoais, pode contactar o Data Protection Officer (DPO) em dpo@eastside.agency.",
  "privacyS1Title": "1. Como recolhemos as informações",
  "privacyS1aTitle": "1.1 Informações que nos fornece",
  "privacyS1aP1": "Podemos recolher diretamente de si as informações, incluindo dados pessoais, se optar por fornecê-las. Por exemplo, ao subscrever a nossa newsletter ou contactar-nos para assistência, pode fornecer-nos nome, endereço de e-mail ou outros dados de contacto.",
  "privacyS1bTitle": "1.2 Informações recolhidas automaticamente",
  "privacyS1bP1": "Quando visita o nosso site, nós e os nossos parceiros podemos recolher automaticamente algumas informações utilizando cookies, web beacons e tecnologias similares. As informações recolhidas podem incluir: endereço IP, características do browser e do dispositivo, dados de navegação e informações sobre o sistema operativo.",
  "privacyS2Title": "2. Cookies e tecnologias similares",
  "privacyS2P1": "Os cookies são ficheiros de texto que os sites utilizam para armazenar informações sobre os utilizadores. Utilizamos diferentes tipos de cookies:",
  "privacyS2Essential": "Cookies essenciais: necessários para o funcionamento do site. Não podem ser desativados.",
  "privacyS2Analytics": "Cookies analíticos: ajudam-nos a entender como os visitantes utilizam o site para melhorar os nossos serviços.",
  "privacyS2Marketing": "Cookies de marketing: utilizados para mostrar anúncios relevantes e medir a eficácia das campanhas. São ativados apenas com o seu consentimento.",
  "privacyS2P2": "Pode gerir as suas preferências de cookies a qualquer momento na página Configurações de cookies. Pode também configurar o browser para bloquear ou eliminar cookies.",
  "privacyS3Title": "3. Finalidades e base jurídica",
  "privacyS3P1": "Utilizamos os seus dados pessoais para: (i) fornecer e melhorar os nossos serviços; (ii) responder às suas solicitações; (iii) enviar comunicações (com o seu consentimento); (iv) analisar a utilização do site para otimizações; (v) cumprir obrigações legais. A base jurídica do tratamento é o consentimento, a execução de um contrato ou o nosso legítimo interesse, consoante o caso.",
  "privacyS4Title": "4. Conservação dos dados",
  "privacyS4P1": "Conservamos os dados pessoais apenas pelo tempo necessário às finalidades para as quais foram recolhidos. Em alguns casos podemos conservá-los por mais tempo para cumprir obrigações legais. Os dados relativos ao consentimento de cookies são conservados conforme os períodos indicados nas configurações de cookies (6 ou 12 meses consoante o país).",
  "privacyS5Title": "5. Os seus direitos (LGPD/GDPR)",
  "privacyS5P1": "Em conformidade com a Lei nº 13.709/2018 (Lei Geral de Proteção de Dados Pessoais - LGPD), a Agência Nacional de Proteção de Dados (ANPD) e o Regulamento UE 2016/679 (GDPR), quando aplicável, tem direito a:",
  "privacyS5Access": "Acesso: obter confirmação da existência de dados que lhe dizem respeito e receber cópia",
  "privacyS5Rectify": "Retificação: solicitar a correção de dados inexatos ou incompletos",
  "privacyS5Delete": "Exclusão: solicitar a exclusão dos seus dados pessoais",
  "privacyS5Limit": "Limitação: solicitar a limitação do tratamento em determinadas circunstâncias",
  "privacyS5Portability": "Portabilidade: receber os dados em formato estruturado e transmissível",
  "privacyS5Oppose": "Oposição: opor-se ao tratamento por motivos legítimos",
  "privacyS5Revoke": "Revogação do consentimento: revogar o consentimento a qualquer momento",
  "privacyS5Complaint": "Reclamação: apresentar reclamação à Autoridade Nacional de Proteção de Dados (ANPD) em gov.br/anpd",
  "privacyS5P2": "Para exercer os seus direitos, contacte-nos em customercare@easyside.agency ou o DPO em dpo@eastside.agency. Responderemos dentro dos prazos legais (geralmente 30 dias).",
  "privacyS6Title": "6. Segurança",
  "privacyS6P1": "Adotamos medidas de segurança técnicas e organizacionais para proteger os dados pessoais de acesso não autorizado, perda, alteração ou destruição. No entanto, nenhuma transmissão na Internet pode garantir segurança absoluta. Se tiver questões sobre a segurança dos dados, contacte-nos.",
  "privacyS7Title": "7. Links para sites de terceiros",
  "privacyS7P1": "O nosso site pode conter links para sites de terceiros. Não somos responsáveis pelas práticas de privacidade ou pelo conteúdo desses sites. Convidamo-lo a consultar as respetivas políticas de privacidade antes de fornecer dados pessoais.",
  "privacyS8Title": "8. Alterações",
  "privacyS8P1": "Podemos atualizar a presente Política periodicamente. A data da última atualização é indicada no topo. Recomendamos consultar esta página regularmente. Em caso de alterações substanciais, comunicaremos a atualização de forma apropriada.",
  "privacyFooterP1": "Para mais informações sobre como gerimos os cookies, visite a página Configurações de cookies.",
  "privacyFooter": "O jogo é proibido para menores de 18 anos. O jogo pode causar dependência.",
  "privacyTermsLink": "Termos e Condições"
}
