{
  "termsTitle": "Termini e Condizioni",
  "termsLastUpdate": "Ultimo aggiornamento: Febbraio 2026",
  "termsIntro1": "Le presenti condizioni generali definiscono le condizioni alle quali un utente utilizza il sito web PlaySignal.io (di seguito \"PlaySignal\" o \"il Sito\").",
  "termsIntro2": "Il Sito è edito da East Side Ltd, con sede legale in 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registrata a Malta con numero di registrazione C74040, Partita IVA MT23084935.",
  "termsIntro3": "Il servizio clienti può essere contattato via email all'indirizzo customercare@easyside.agency per qualsiasi richiesta di assistenza o reclamo.",
  "termsIntro4": "Vi preghiamo di leggere le presenti condizioni generali d'uso con attenzione. L'utilizzo del servizio comporta l'accettazione delle presenti condizioni. Si accetta inoltre di utilizzare i nostri servizi nel totale rispetto delle leggi del proprio Paese di residenza.",
  "termsS1Title": "1. Descrizione dei servizi",
  "termsS1P1": "PlaySignal è un sito Internet che mette a disposizione del pubblico informazioni, analisi e confronti relativi alle quote delle scommesse sportive, alle partite e ai pronostici. Il servizio comprende funzionalità tipiche di questo tipo di piattaforma informativa.",
  "termsS1P2": "PlaySignal si riserva il diritto di modificare in qualsiasi momento le funzionalità del servizio o di eliminarle qualora lo ritenga opportuno. Il Sito può contenere link verso contenuti esterni gestiti da terzi che esulano dal nostro controllo. PlaySignal non si assume responsabilità di alcun tipo nei confronti di contenuti, informazioni, prodotti e servizi offerti dai siti raggiungibili tramite link esterni.",
  "termsS2Title": "2. Natura informativa del servizio",
  "termsS2P1": "PlaySignal è un servizio di informazione sportiva. Non propone giochi d'azzardo né gestisce scommesse. In Italia il gioco d'azzardo e le scommesse sono regolati dalla legge n. 88/2009 e dal D.L. 87/2018 (conv. in legge 96/2018); il gioco è vietato ai minori di 18 anni. L'Agenzia delle Dogane e dei Monopoli (ADM) è l'autorità di vigilanza. Le informazioni fornite non costituiscono in alcun caso un consiglio o una raccomandazione di qualunque natura. L'uso dei contenuti e delle informazioni disponibili su PlaySignal è sotto la sola responsabilità dell'utente.",
  "termsS3Title": "3. Durata e utilizzo del servizio",
  "termsS3P1": "Il servizio è fornito senza limite di durata. Data la gratuità del servizio, l'utente può porre termine all'utilizzo in qualsiasi momento. PlaySignal si riserva il diritto di sospendere o chiudere il servizio in qualsiasi momento, con o senza preavviso.",
  "termsS3P2": "In caso di mancato rispetto delle presenti condizioni o per qualsiasi altra ragione legittima, PlaySignal può sospendere l'accesso al servizio immediatamente e senza previa notifica.",
  "termsS4Title": "4. Limitazione di responsabilità",
  "termsS4P1": "Le informazioni diffuse attraverso il servizio sono fornite senza alcuna garanzia di affidabilità, correttezza o esaustività. Il servizio è fornito \"così com'è\". PlaySignal non può essere ritenuto responsabile di perdite o danni derivanti dall'utilizzo del Sito, da link esterni, da malfunzionamenti tecnici, da cause di forza maggiore o da azioni di terzi.",
  "termsS5Title": "5. Dati personali",
  "termsS5P1": "Per quanto riguarda il trattamento dei dati personali, si rimanda all'Informativa sulla privacy. L'utente dispone in ogni momento del diritto di accesso, rettifica e cancellazione dei propri dati, contattando il servizio clienti o il Data Protection Officer all'indirizzo indicato nell'informativa privacy.",
  "termsS6Title": "6. Uso consentito",
  "termsS6P1": "È autorizzato soltanto un uso personale e non commerciale del servizio. È vietato pubblicare, riprodurre o ridiffondere i contenuti del Sito senza autorizzazione. L'utente si impegna a non pubblicare contenuti illeciti, diffamatori, discriminatori o in violazione dei diritti di terzi.",
  "termsS7Title": "7. Modifiche",
  "termsS7P1": "PlaySignal è libero di modificare le presenti condizioni in qualsiasi momento. Il proseguimento dell'utilizzo del servizio dopo eventuali modifiche vale come accettazione dei termini aggiornati. Si consiglia di consultare periodicamente questa pagina.",
  "termsS8Title": "8. Legge applicabile",
  "termsS8P1": "Le presenti condizioni sono soggette alla legge maltese. Per qualsiasi controversia, sarà competente il foro di Malta, salvo disposizioni inderogabili a favore del consumatore.",
  "termsS9Title": "9. Gioco responsabile",
  "termsS9P1": "Il gioco d'azzardo e le scommesse possono causare dipendenza. In Italia il gioco è vietato ai minori di 18 anni (legge n. 88/2009, D.L. 87/2018). In caso di problematiche legate al gioco, si consiglia di contattare il numero verde 800 55 88 22 (Istituto Superiore di Sanità) o visitare il sito gioca-responsabile.it.",
  "termsFooter": "Il gioco è vietato ai minori di anni 18. Il gioco può causare dipendenza.",
  "termsPrivacyLink": "Informativa sulla privacy",
  "termsCookieLink": "Impostazioni cookie",
  "privacyTitle": "Informativa sulla privacy",
  "privacyLastUpdate": "Ultimo aggiornamento: Febbraio 2026",
  "privacyIntro1": "La presente Informativa sulla privacy descrive come East Side Ltd (di seguito \"PlaySignal\", \"noi\" o \"il Titolare\") raccoglie, utilizza e protegge i dati personali degli utenti del sito PlaySignal.io. La presente Informativa si applica in aggiunta ai nostri Termini e Condizioni.",
  "privacyIntro2": "Titolare del trattamento: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registrazione: C74040, Partita IVA: MT23084935.",
  "privacyIntro3": "Contatti: per richieste su questo documento o sulle nostre pratiche privacy, contattateci a customercare@easyside.agency. Per questioni relative alla protezione dei dati personali, potete contattare il Data Protection Officer (DPO) all'indirizzo dpo@eastside.agency.",
  "privacyS1Title": "1. Come raccogliamo le informazioni",
  "privacyS1aTitle": "1.1 Informazioni che ci fornite",
  "privacyS1aP1": "Potete raccogliere direttamente da voi le informazioni, compresi i dati personali, se scegliete di fornircele. Ad esempio, quando vi iscrivete alla nostra newsletter o ci contattate per assistenza, potete fornirci nome, indirizzo email o altri dati di contatto.",
  "privacyS1bTitle": "1.2 Informazioni raccolte automaticamente",
  "privacyS1bP1": "Quando visitate il nostro sito, noi e i nostri partner possiamo raccogliere automaticamente alcune informazioni utilizzando cookie, web beacon e tecnologie simili. Le informazioni raccolte possono includere: indirizzo IP, caratteristiche del browser e del dispositivo, dati di navigazione (clickstream) e informazioni sul sistema operativo.",
  "privacyS2Title": "2. Cookie e tecnologie simili",
  "privacyS2P1": "I cookie sono file di testo che i siti web utilizzano per memorizzare informazioni sugli utenti. Utilizziamo diverse tipologie di cookie:",
  "privacyS2Essential": "Cookie essenziali: necessari per il funzionamento del sito. Non possono essere disattivati.",
  "privacyS2Analytics": "Cookie analitici: ci aiutano a capire come i visitatori utilizzano il sito per migliorare i nostri servizi.",
  "privacyS2Marketing": "Cookie di marketing: utilizzati per mostrare annunci pertinenti e misurare l'efficacia delle campagne. Sono attivati solo con il vostro consenso.",
  "privacyS2P2": "Potete gestire le vostre preferenze sui cookie in qualsiasi momento dalla pagina Impostazioni cookie. Potete inoltre configurare il browser per bloccare o eliminare i cookie.",
  "privacyS3Title": "3. Finalità e base giuridica",
  "privacyS3P1": "Utilizziamo i vostri dati personali per: (i) fornire e migliorare i nostri servizi; (ii) rispondere alle vostre richieste; (iii) inviare comunicazioni (con il vostro consenso); (iv) analizzare l'utilizzo del sito per ottimizzazioni; (v) rispettare obblighi di legge. La base giuridica del trattamento è il consenso, l'esecuzione di un contratto o il nostro legittimo interesse, a seconda del caso.",
  "privacyS4Title": "4. Conservazione dei dati",
  "privacyS4P1": "Conserviamo i dati personali solo per il tempo necessario alle finalità per cui sono stati raccolti. In alcuni casi possiamo conservarli più a lungo per rispettare obblighi di legge. I dati relativi al consenso cookie vengono conservati secondo i periodi indicati nelle impostazioni cookie (6 o 12 mesi a seconda del paese).",
  "privacyS5Title": "5. I vostri diritti (GDPR)",
  "privacyS5P1": "In conformità al Regolamento UE 2016/679 (GDPR) e alla normativa italiana applicabile, avete diritto a:",
  "privacyS5Access": "Accesso: ottenere conferma dell'esistenza di dati che vi riguardano e riceverne copia",
  "privacyS5Rectify": "Rettifica: richiedere la correzione di dati inesatti o incompleti",
  "privacyS5Delete": "Cancellazione: richiedere la cancellazione dei vostri dati personali",
  "privacyS5Limit": "Limitazione: richiedere la limitazione del trattamento in determinate circostanze",
  "privacyS5Portability": "Portabilità: ricevere i dati in formato strutturato e trasmissibile",
  "privacyS5Oppose": "Opposizione: opporvi al trattamento per motivi legittimi",
  "privacyS5Revoke": "Revoca del consenso: revocare il consenso in qualsiasi momento (per i trattamenti basati su consenso)",
  "privacyS5Complaint": "Reclamo: proporre reclamo all'Autorità Garante per la Protezione dei Dati Personali (garanteprivacy.it)",
  "privacyS5P2": "Per esercitare i vostri diritti, contattateci a customercare@easyside.agency o il DPO a dpo@eastside.agency. Risponderemo entro i termini di legge (generalmente 30 giorni).",
  "privacyS6Title": "6. Sicurezza",
  "privacyS6P1": "Adottiamo misure di sicurezza tecniche e organizzative per proteggere i dati personali da accesso non autorizzato, perdita, alterazione o distruzione. Tuttavia, nessuna trasmissione su Internet può garantire una sicurezza assoluta. Se avete domande sulla sicurezza dei dati, contattateci.",
  "privacyS7Title": "7. Link a siti terzi",
  "privacyS7P1": "Il nostro sito può contenere link a siti web di terzi. Non siamo responsabili per le pratiche di privacy o il contenuto di tali siti. Vi invitiamo a consultare le rispettive informative sulla privacy prima di fornire dati personali.",
  "privacyS8Title": "8. Modifiche",
  "privacyS8P1": "Potremmo aggiornare la presente Informativa periodicamente. La data dell'ultimo aggiornamento è indicata in cima. Vi consigliamo di consultare regolarmente questa pagina. In caso di modifiche sostanziali, comunicheremo l'aggiornamento in modo appropriato.",
  "privacyFooterP1": "Per ulteriori informazioni su come gestiamo i cookie, visitate la pagina Impostazioni cookie.",
  "privacyFooter": "Il gioco è vietato ai minori di anni 18. Il gioco può causare dipendenza.",
  "privacyTermsLink": "Termini e Condizioni"
}
