{
  "termsTitle": "Terms and Conditions",
  "termsLastUpdate": "Last updated: February 2026",
  "termsIntro1": "These general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").",
  "termsIntro2": "The Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.",
  "termsIntro3": "Customer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.",
  "termsIntro4": "Please read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.",
  "termsS1Title": "1. Description of services",
  "termsS1P1": "PlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.",
  "termsS1P2": "PlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.",
  "termsS2Title": "2. Informative nature of the service",
  "termsS2P1": "PlaySignal is a sports information service. It does not offer gambling or manage bets. Gambling is prohibited for minors under 18 years of age in the jurisdictions we serve. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.",
  "termsS3Title": "3. Duration and use of the service",
  "termsS3P1": "The service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.",
  "termsS3P2": "In case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.",
  "termsS4Title": "4. Limitation of liability",
  "termsS4P1": "Information disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.",
  "termsS5Title": "5. Personal data",
  "termsS5P1": "Regarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.",
  "termsS6Title": "6. Permitted use",
  "termsS6P1": "Only personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.",
  "termsS7Title": "7. Modifications",
  "termsS7P1": "PlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.",
  "termsS8Title": "8. Applicable law",
  "termsS8P1": "These terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.",
  "termsS9Title": "9. Responsible gambling",
  "termsS9P1": "Gambling can cause addiction. Gambling is prohibited for minors under 18 years of age. In case of gambling-related problems, we recommend contacting dedicated helplines or visiting responsible gambling websites in your jurisdiction.",
  "termsFooter": "Gambling is prohibited for minors under 18. Gambling can cause addiction.",
  "termsPrivacyLink": "Privacy Policy",
  "termsCookieLink": "Cookie settings",
  "privacyTitle": "Privacy Policy",
  "privacyLastUpdate": "Last updated: February 2026",
  "privacyIntro1": "This Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.",
  "privacyIntro2": "Data Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.",
  "privacyIntro3": "Contacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.",
  "privacyS1Title": "1. How we collect information",
  "privacyS1aTitle": "1.1 Information you provide to us",
  "privacyS1aP1": "We may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.",
  "privacyS1bTitle": "1.2 Information collected automatically",
  "privacyS1bP1": "When you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.",
  "privacyS2Title": "2. Cookies and similar technologies",
  "privacyS2P1": "Cookies are text files that websites use to store information about users. We use different types of cookies:",
  "privacyS2Essential": "Essential cookies: necessary for the site to function. They cannot be disabled.",
  "privacyS2Analytics": "Analytics cookies: help us understand how visitors use the site to improve our services.",
  "privacyS2Marketing": "Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.",
  "privacyS2P2": "You can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.",
  "privacyS3Title": "3. Purposes and legal basis",
  "privacyS3P1": "We use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.",
  "privacyS4Title": "4. Data retention",
  "privacyS4P1": "We retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (6 or 12 months depending on the country).",
  "privacyS5Title": "5. Your rights (GDPR)",
  "privacyS5P1": "In accordance with EU Regulation 2016/679 (GDPR) and applicable local legislation, you have the right to:",
  "privacyS5Access": "Access: obtain confirmation of the existence of data concerning you and receive a copy",
  "privacyS5Rectify": "Rectification: request correction of inaccurate or incomplete data",
  "privacyS5Delete": "Erasure: request deletion of your personal data",
  "privacyS5Limit": "Restriction: request restriction of processing in certain circumstances",
  "privacyS5Portability": "Portability: receive data in a structured and transferable format",
  "privacyS5Oppose": "Object: object to processing on legitimate grounds",
  "privacyS5Revoke": "Withdraw consent: withdraw consent at any time (for consent-based processing)",
  "privacyS5Complaint": "Complain: lodge a complaint with the relevant data protection authority",
  "privacyS5P2": "To exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days).",
  "privacyS6Title": "6. Security",
  "privacyS6P1": "We adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.",
  "privacyS7Title": "7. Links to third-party sites",
  "privacyS7P1": "Our site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.",
  "privacyS8Title": "8. Modifications",
  "privacyS8P1": "We may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.",
  "privacyFooterP1": "For more information on how we manage cookies, visit the Cookie settings page.",
  "privacyFooter": "Gambling is prohibited for minors under 18. Gambling can cause addiction.",
  "privacyTermsLink": "Terms and Conditions"
}
