{
  "it": {
    "terms": {
      "linkName": "Termini e Condizioni",
      "title": "Termini e Condizioni",
      "fullText": "Ultimo aggiornamento: Febbraio 2026\n\nLe presenti condizioni generali definiscono le condizioni alle quali un utente utilizza il sito web PlaySignal.io (di seguito \"PlaySignal\" o \"il Sito\").\n\nIl Sito è edito da East Side Ltd, con sede legale in 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registrata a Malta con numero di registrazione C74040, Partita IVA MT23084935.\n\nIl servizio clienti può essere contattato via email all'indirizzo customercare@easyside.agency per qualsiasi richiesta di assistenza o reclamo.\n\nVi preghiamo di leggere le presenti condizioni generali d'uso con attenzione. L'utilizzo del servizio comporta l'accettazione delle presenti condizioni. Si accetta inoltre di utilizzare i nostri servizi nel totale rispetto delle leggi del proprio Paese di residenza.\n\n1. Descrizione dei servizi\nPlaySignal è un sito Internet che mette a disposizione del pubblico informazioni, analisi e confronti relativi alle quote delle scommesse sportive, alle partite e ai pronostici. Il servizio comprende funzionalità tipiche di questo tipo di piattaforma informativa.\nPlaySignal si riserva il diritto di modificare in qualsiasi momento le funzionalità del servizio o di eliminarle qualora lo ritenga opportuno. Il Sito può contenere link verso contenuti esterni gestiti da terzi che esulano dal nostro controllo. PlaySignal non si assume responsabilità di alcun tipo nei confronti di contenuti, informazioni, prodotti e servizi offerti dai siti raggiungibili tramite link esterni.\n\n2. Natura informativa del servizio\nPlaySignal è un servizio di informazione sportiva. Non propone giochi d'azzardo né gestisce scommesse. In Italia il gioco d'azzardo e le scommesse sono regolati dalla legge n. 88/2009 e dal D.L. 87/2018 (conv. in legge 96/2018); il gioco è vietato ai minori di 18 anni. L'Agenzia delle Dogane e dei Monopoli (ADM) è l'autorità di vigilanza. Le informazioni fornite non costituiscono in alcun caso un consiglio o una raccomandazione di qualunque natura. L'uso dei contenuti e delle informazioni disponibili su PlaySignal è sotto la sola responsabilità dell'utente.\n\n3. Durata e utilizzo del servizio\nIl servizio è fornito senza limite di durata. Data la gratuità del servizio, l'utente può porre termine all'utilizzo in qualsiasi momento. PlaySignal si riserva il diritto di sospendere o chiudere il servizio in qualsiasi momento, con o senza preavviso.\nIn caso di mancato rispetto delle presenti condizioni o per qualsiasi altra ragione legittima, PlaySignal può sospendere l'accesso al servizio immediatamente e senza previa notifica.\n\n4. Limitazione di responsabilità\nLe informazioni diffuse attraverso il servizio sono fornite senza alcuna garanzia di affidabilità, correttezza o esaustività. Il servizio è fornito \"così com'è\". PlaySignal non può essere ritenuto responsabile di perdite o danni derivanti dall'utilizzo del Sito, da link esterni, da malfunzionamenti tecnici, da cause di forza maggiore o da azioni di terzi.\n\n5. Dati personali\nPer quanto riguarda il trattamento dei dati personali, si rimanda all'Informativa sulla privacy. L'utente dispone in ogni momento del diritto di accesso, rettifica e cancellazione dei propri dati, contattando il servizio clienti o il Data Protection Officer all'indirizzo indicato nell'informativa privacy.\n\n6. Uso consentito\nÈ autorizzato soltanto un uso personale e non commerciale del servizio. È vietato pubblicare, riprodurre o ridiffondere i contenuti del Sito senza autorizzazione. L'utente si impegna a non pubblicare contenuti illeciti, diffamatori, discriminatori o in violazione dei diritti di terzi.\n\n7. Modifiche\nPlaySignal è libero di modificare le presenti condizioni in qualsiasi momento. Il proseguimento dell'utilizzo del servizio dopo eventuali modifiche vale come accettazione dei termini aggiornati. Si consiglia di consultare periodicamente questa pagina.\n\n8. Legge applicabile\nLe presenti condizioni sono soggette alla legge maltese. Per qualsiasi controversia, sarà competente il foro di Malta, salvo disposizioni inderogabili a favore del consumatore.\n\n9. Gioco responsabile\nIl gioco d'azzardo e le scommesse possono causare dipendenza. In Italia il gioco è vietato ai minori di 18 anni (legge n. 88/2009, D.L. 87/2018). In caso di problematiche legate al gioco, si consiglia di contattare il numero verde 800 55 88 22 (Istituto Superiore di Sanità) o visitare il sito gioca-responsabile.it.\n\nIl gioco è vietato ai minori di anni 18. Il gioco può causare dipendenza."
    },
    "privacy": {
      "linkName": "Informativa sulla privacy",
      "title": "Informativa sulla privacy",
      "fullText": "Ultimo aggiornamento: Febbraio 2026\n\nLa presente Informativa sulla privacy descrive come East Side Ltd (di seguito \"PlaySignal\", \"noi\" o \"il Titolare\") raccoglie, utilizza e protegge i dati personali degli utenti del sito PlaySignal.io. La presente Informativa si applica in aggiunta ai nostri Termini e Condizioni.\n\nTitolare del trattamento: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registrazione: C74040, Partita IVA: MT23084935.\n\nContatti: per richieste su questo documento o sulle nostre pratiche privacy, contattateci a customercare@easyside.agency. Per questioni relative alla protezione dei dati personali, potete contattare il Data Protection Officer (DPO) all'indirizzo dpo@eastside.agency.\n\n1. Come raccogliamo le informazioni\n1.1 Informazioni che ci fornite\nPotete raccogliere direttamente da voi le informazioni, compresi i dati personali, se scegliete di fornircele. Ad esempio, quando vi iscrivete alla nostra newsletter o ci contattate per assistenza, potete fornirci nome, indirizzo email o altri dati di contatto.\n\n1.2 Informazioni raccolte automaticamente\nQuando visitate il nostro sito, noi e i nostri partner possiamo raccogliere automaticamente alcune informazioni utilizzando cookie, web beacon e tecnologie simili. Le informazioni raccolte possono includere: indirizzo IP, caratteristiche del browser e del dispositivo, dati di navigazione (clickstream) e informazioni sul sistema operativo.\n\n2. Cookie e tecnologie simili\nI cookie sono file di testo che i siti web utilizzano per memorizzare informazioni sugli utenti. Utilizziamo diverse tipologie di cookie:\n\n- Cookie essenziali: necessari per il funzionamento del sito. Non possono essere disattivati.\n- Cookie analitici: ci aiutano a capire come i visitatori utilizzano il sito per migliorare i nostri servizi.\n- Cookie di marketing: utilizzati per mostrare annunci pertinenti e misurare l'efficacia delle campagne. Sono attivati solo con il vostro consenso.\n\nPotete gestire le vostre preferenze sui cookie in qualsiasi momento dalla pagina Impostazioni cookie. Potete inoltre configurare il browser per bloccare o eliminare i cookie.\n\n3. Finalità e base giuridica\nUtilizziamo i vostri dati personali per: (i) fornire e migliorare i nostri servizi; (ii) rispondere alle vostre richieste; (iii) inviare comunicazioni (con il vostro consenso); (iv) analizzare l'utilizzo del sito per ottimizzazioni; (v) rispettare obblighi di legge. La base giuridica del trattamento è il consenso, l'esecuzione di un contratto o il nostro legittimo interesse, a seconda del caso.\n\n4. Conservazione dei dati\nConserviamo i dati personali solo per il tempo necessario alle finalità per cui sono stati raccolti. In alcuni casi possiamo conservarli più a lungo per rispettare obblighi di legge. I dati relativi al consenso cookie vengono conservati secondo i periodi indicati nelle impostazioni cookie (6 o 12 mesi a seconda del paese).\n\n5. I vostri diritti (GDPR)\nIn conformità al Regolamento UE 2016/679 (GDPR) e alla normativa italiana applicabile, avete diritto a:\n\n- Accesso: ottenere conferma dell'esistenza di dati che vi riguardano e riceverne copia\n- Rettifica: richiedere la correzione di dati inesatti o incompleti\n- Cancellazione: richiedere la cancellazione dei vostri dati personali\n- Limitazione: richiedere la limitazione del trattamento in determinate circostanze\n- Portabilità: ricevere i dati in formato strutturato e trasmissibile\n- Opposizione: opporvi al trattamento per motivi legittimi\n- Revoca del consenso: revocare il consenso in qualsiasi momento (per i trattamenti basati su consenso)\n- Reclamo: proporre reclamo all'Autorità Garante per la Protezione dei Dati Personali (garanteprivacy.it)\n\nPer esercitare i vostri diritti, contattateci a customercare@easyside.agency o il DPO a dpo@eastside.agency. Risponderemo entro i termini di legge (generalmente 30 giorni).\n\n6. Sicurezza\nAdottiamo misure di sicurezza tecniche e organizzative per proteggere i dati personali da accesso non autorizzato, perdita, alterazione o distruzione. Tuttavia, nessuna trasmissione su Internet può garantire una sicurezza assoluta. Se avete domande sulla sicurezza dei dati, contattateci.\n\n7. Link a siti terzi\nIl nostro sito può contenere link a siti web di terzi. Non siamo responsabili per le pratiche di privacy o il contenuto di tali siti. Vi invitiamo a consultare le rispettive informative sulla privacy prima di fornire dati personali.\n\n8. Modifiche\nPotremmo aggiornare la presente Informativa periodicamente. La data dell'ultimo aggiornamento è indicata in cima. Vi consigliamo di consultare regolarmente questa pagina. In caso di modifiche sostanziali, comunicheremo l'aggiornamento in modo appropriato.\n\nPer ulteriori informazioni su come gestiamo i cookie, visitate la pagina Impostazioni cookie.\n\nIl gioco è vietato ai minori di anni 18. Il gioco può causare dipendenza."
    }
  },
  "fr": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. Gambling is prohibited for minors under 18 years of age in the jurisdictions we serve. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling can cause addiction. Gambling is prohibited for minors under 18 years of age. In case of gambling-related problems, we recommend contacting dedicated helplines or visiting responsible gambling websites in your jurisdiction.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (6 or 12 months depending on the country).\n\n5. Your rights (GDPR)\nIn accordance with EU Regulation 2016/679 (GDPR) and applicable local legislation, you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the relevant data protection authority\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  },
  "es": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. Gambling is prohibited for minors under 18 years of age in the jurisdictions we serve. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling can cause addiction. Gambling is prohibited for minors under 18 years of age. In case of gambling-related problems, we recommend contacting dedicated helplines or visiting responsible gambling websites in your jurisdiction.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (6 or 12 months depending on the country).\n\n5. Your rights (GDPR)\nIn accordance with EU Regulation 2016/679 (GDPR) and applicable local legislation, you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the relevant data protection authority\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  },
  "de": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. Gambling is prohibited for minors under 18 years of age in the jurisdictions we serve. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling can cause addiction. Gambling is prohibited for minors under 18 years of age. In case of gambling-related problems, we recommend contacting dedicated helplines or visiting responsible gambling websites in your jurisdiction.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (6 or 12 months depending on the country).\n\n5. Your rights (GDPR)\nIn accordance with EU Regulation 2016/679 (GDPR) and applicable local legislation, you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the relevant data protection authority\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  },
  "en": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. Gambling is prohibited for minors under 18 years of age in the jurisdictions we serve. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling can cause addiction. Gambling is prohibited for minors under 18 years of age. In case of gambling-related problems, we recommend contacting dedicated helplines or visiting responsible gambling websites in your jurisdiction.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (6 or 12 months depending on the country).\n\n5. Your rights (GDPR)\nIn accordance with EU Regulation 2016/679 (GDPR) and applicable local legislation, you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the relevant data protection authority\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  },
  "pt-BR": {
    "terms": {
      "linkName": "Termos e Condições",
      "title": "Termos e Condições",
      "fullText": "Última atualização: Fevereiro 2026\n\nAs presentes condições gerais definem os termos sob os quais um usuário utiliza o site PlaySignal.io (doravante \"PlaySignal\" ou \"o Site\").\n\nO Site é editado pela East Side Ltd, com sede em 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registrada em Malta sob o número C74040, CNPJ/IVA MT23084935.\n\nO atendimento ao cliente pode ser contatado por e-mail em customercare@easyside.agency para qualquer solicitação de assistência ou reclamação.\n\nPedimos que leia atentamente as presentes condições gerais de uso. O uso do serviço implica a aceitação das presentes condições. O usuário concorda ainda em utilizar nossos serviços em total conformidade com as leis do seu país de residência.\n\n1. Descrição dos serviços\nO PlaySignal é um site que disponibiliza ao público informações, análises e comparações relativas às odds de apostas esportivas, partidas e previsões. O serviço inclui funcionalidades típicas deste tipo de plataforma informativa.\nO PlaySignal reserva-se o direito de modificar a qualquer momento as funcionalidades do serviço ou eliminá-las quando considerar apropriado. O Site pode conter links para conteúdos externos geridos por terceiros fora do nosso controle. O PlaySignal não assume responsabilidade de qualquer tipo em relação a conteúdos, informações, produtos e serviços oferecidos pelos sites acessíveis através de links externos.\n\n2. Natureza informativa do serviço\nO PlaySignal é um serviço de informação esportiva. Não oferece jogos de azar nem gerencia apostas. No Brasil, as apostas de quota fixa são reguladas pela Lei nº 13.756/2018 (apostas esportivas). O jogo e as apostas são proibidos para menores de 18 anos, em conformidade com a legislação aplicável. As informações fornecidas não constituem em nenhum caso aconselhamento ou recomendação de qualquer natureza. O uso dos conteúdos e informações disponíveis no PlaySignal é de exclusiva responsabilidade do usuário.\n\n3. Duração e utilização do serviço\nO serviço é fornecido sem limite de duração. Dada a gratuidade do serviço, o usuário pode encerrar a utilização a qualquer momento. O PlaySignal reserva-se o direito de suspender ou encerrar o serviço a qualquer momento, com ou sem aviso prévio.\nEm caso de descumprimento das presentes condições ou por qualquer outra razão legítima, o PlaySignal pode suspender o acesso ao serviço imediatamente e sem aviso prévio.\n\n4. Limitação de responsabilidade\nAs informações divulgadas através do serviço são fornecidas sem qualquer garantia de confiabilidade, correção ou exaustividade. O serviço é fornecido \"como está\". O PlaySignal não pode ser considerado responsável por perdas ou danos decorrentes do uso do Site, de links externos, de falhas técnicas, de força maior ou de ações de terceiros.\n\n5. Dados pessoais\nQuanto ao tratamento de dados pessoais, remetemos à Política de Privacidade. O usuário dispõe a qualquer momento do direito de acesso, retificação e exclusão dos seus dados, contactando o atendimento ao cliente ou o Data Protection Officer no endereço indicado na política de privacidade.\n\n6. Uso permitido\nÉ autorizado apenas o uso pessoal e não comercial do serviço. É proibido publicar, reproduzir ou redistribuir os conteúdos do Site sem autorização. O usuário compromete-se a não publicar conteúdos ilícitos, difamatórios, discriminatórios ou em violação dos direitos de terceiros.\n\n7. Alterações\nO PlaySignal é livre para modificar as presentes condições a qualquer momento. A continuação da utilização do serviço após eventuais alterações vale como aceitação dos termos atualizados. Recomendamos consultar esta página periodicamente.\n\n8. Lei aplicável\nAs presentes condições estão sujeitas à lei maltesa. Para qualquer litígio, será competente o foro de Malta, salvo disposições inderrogáveis em favor do consumidor.\n\n9. Jogo responsável\nO jogo e as apostas podem causar dependência. No Brasil, o jogo d'azzardo e as apostas esportivas (Lei nº 13.756/2018) são proibidos para menores de 18 anos. O art. 33 da referida lei estabelece práticas de responsabilidade social para a publicidade de apostas. Em caso de problemas relacionados ao jogo, recomenda-se contatar o Ministério da Saúde (Disque Saúde 136) ou visitar sites dedicados ao jogo responsável.\n\nO jogo é proibido para menores de 18 anos. O jogo pode causar dependência."
    },
    "privacy": {
      "linkName": "Política de Privacidade",
      "title": "Política de Privacidade",
      "fullText": "Última atualização: Fevereiro 2026\n\nA presente Política de Privacidade descreve como a East Side Ltd (doravante \"PlaySignal\", \"nós\" ou \"o Titular\") coleta, utiliza e protege os dados pessoais dos usuários do site PlaySignal.io. A presente Política aplica-se em adição aos nossos Termos e Condições.\n\nTitular do tratamento: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registro: C74040, IVA: MT23084935.\n\nContatos: para solicitações sobre este documento ou nossas práticas de privacidade, contacte-nos em customercare@easyside.agency. Para questões relativas à proteção de dados pessoais, pode contactar o Data Protection Officer (DPO) em dpo@eastside.agency.\n\n1. Como recolhemos as informações\n1.1 Informações que nos fornece\nPodemos recolher diretamente de si as informações, incluindo dados pessoais, se optar por fornecê-las. Por exemplo, ao subscrever a nossa newsletter ou contactar-nos para assistência, pode fornecer-nos nome, endereço de e-mail ou outros dados de contacto.\n\n1.2 Informações recolhidas automaticamente\nQuando visita o nosso site, nós e os nossos parceiros podemos recolher automaticamente algumas informações utilizando cookies, web beacons e tecnologias similares. As informações recolhidas podem incluir: endereço IP, características do browser e do dispositivo, dados de navegação e informações sobre o sistema operativo.\n\n2. Cookies e tecnologias similares\nOs cookies são ficheiros de texto que os sites utilizam para armazenar informações sobre os utilizadores. Utilizamos diferentes tipos de cookies:\n\n- Cookies essenciais: necessários para o funcionamento do site. Não podem ser desativados.\n- Cookies analíticos: ajudam-nos a entender como os visitantes utilizam o site para melhorar os nossos serviços.\n- Cookies de marketing: utilizados para mostrar anúncios relevantes e medir a eficácia das campanhas. São ativados apenas com o seu consentimento.\n\nPode gerir as suas preferências de cookies a qualquer momento na página Configurações de cookies. Pode também configurar o browser para bloquear ou eliminar cookies.\n\n3. Finalidades e base jurídica\nUtilizamos os seus dados pessoais para: (i) fornecer e melhorar os nossos serviços; (ii) responder às suas solicitações; (iii) enviar comunicações (com o seu consentimento); (iv) analisar a utilização do site para otimizações; (v) cumprir obrigações legais. A base jurídica do tratamento é o consentimento, a execução de um contrato ou o nosso legítimo interesse, consoante o caso.\n\n4. Conservação dos dados\nConservamos os dados pessoais apenas pelo tempo necessário às finalidades para as quais foram recolhidos. Em alguns casos podemos conservá-los por mais tempo para cumprir obrigações legais. Os dados relativos ao consentimento de cookies são conservados conforme os períodos indicados nas configurações de cookies (6 ou 12 meses consoante o país).\n\n5. Os seus direitos (LGPD/GDPR)\nEm conformidade com a Lei nº 13.709/2018 (Lei Geral de Proteção de Dados Pessoais - LGPD), a Agência Nacional de Proteção de Dados (ANPD) e o Regulamento UE 2016/679 (GDPR), quando aplicável, tem direito a:\n\n- Acesso: obter confirmação da existência de dados que lhe dizem respeito e receber cópia\n- Retificação: solicitar a correção de dados inexatos ou incompletos\n- Exclusão: solicitar a exclusão dos seus dados pessoais\n- Limitação: solicitar a limitação do tratamento em determinadas circunstâncias\n- Portabilidade: receber os dados em formato estruturado e transmissível\n- Oposição: opor-se ao tratamento por motivos legítimos\n- Revogação do consentimento: revogar o consentimento a qualquer momento\n- Reclamação: apresentar reclamação à Autoridade Nacional de Proteção de Dados (ANPD) em gov.br/anpd\n\nPara exercer os seus direitos, contacte-nos em customercare@easyside.agency ou o DPO em dpo@eastside.agency. Responderemos dentro dos prazos legais (geralmente 30 dias).\n\n6. Segurança\nAdotamos medidas de segurança técnicas e organizacionais para proteger os dados pessoais de acesso não autorizado, perda, alteração ou destruição. No entanto, nenhuma transmissão na Internet pode garantir segurança absoluta. Se tiver questões sobre a segurança dos dados, contacte-nos.\n\n7. Links para sites de terceiros\nO nosso site pode conter links para sites de terceiros. Não somos responsáveis pelas práticas de privacidade ou pelo conteúdo desses sites. Convidamo-lo a consultar as respetivas políticas de privacidade antes de fornecer dados pessoais.\n\n8. Alterações\nPodemos atualizar a presente Política periodicamente. A data da última atualização é indicada no topo. Recomendamos consultar esta página regularmente. Em caso de alterações substanciais, comunicaremos a atualização de forma apropriada.\n\nPara mais informações sobre como gerimos os cookies, visite a página Configurações de cookies.\n\nO jogo é proibido para menores de 18 anos. O jogo pode causar dependência."
    }
  },
  "en-NG": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. In Nigeria, gambling and betting are regulated by the National Lottery Act 2005 and state-level legislation (e.g. Lagos State Lotteries and Gaming Authority Law 2021, FCT Lottery Regulatory Office). Gambling is prohibited for minors under 18 years of age. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling and betting can cause addiction. In Nigeria, gambling is prohibited for minors under 18 years of age under the National Lottery Act 2005 and applicable state gaming regulations. In case of gambling-related problems, we recommend contacting dedicated helplines or visiting responsible gambling resources such as those provided by the National Lottery Regulatory Commission (NLRC) or state lottery authorities.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (12 months for Nigeria).\n\n5. Your rights (NDPR/NDPC)\nIn accordance with the Nigeria Data Protection Regulation 2019 (NDPR), the Nigeria Data Protection Act 2023, and the Nigeria Data Protection Commission (NDPC), you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the Nigeria Data Protection Commission (NDPC) at ndpc.gov.ng\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days under NDPR).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  },
  "en-KE": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. In Kenya, gambling, lotteries and betting are regulated by the Betting, Lotteries and Gaming Act (Cap. 131), enforced by the Betting Control and Licensing Board (BCLB). Gambling is prohibited for minors under 18 years of age. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling and betting can cause addiction. In Kenya, gambling is prohibited for minors under 18 years of age under the Betting, Lotteries and Gaming Act (Cap. 131). The Betting Control and Licensing Board (BCLB) regulates bookmakers, lotteries and gaming. In case of gambling-related problems, we recommend contacting the BCLB (bclb.go.ke) or visiting dedicated responsible gambling resources in your jurisdiction.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (12 months for Kenya).\n\n5. Your rights (Data Protection Act 2019)\nIn accordance with the Kenya Data Protection Act 2019 and the Office of the Data Protection Commissioner (ODPC), you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the Office of the Data Protection Commissioner (ODPC) at odpc.go.ke\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 30 days under the Data Protection Act 2019).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  },
  "en-GH": {
    "terms": {
      "linkName": "Terms and Conditions",
      "title": "Terms and Conditions",
      "fullText": "Last updated: February 2026\n\nThese general terms and conditions define the terms under which a user utilises the PlaySignal.io website (hereinafter \"PlaySignal\" or \"the Site\").\n\nThe Site is published by East Side Ltd, with registered office at 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta, registered in Malta under number C74040, VAT MT23084935.\n\nCustomer service can be contacted by email at customercare@easyside.agency for any assistance or complaint requests.\n\nPlease read these general terms and conditions carefully. Use of the service constitutes acceptance of these terms. You also agree to use our services in full compliance with the laws of your country of residence.\n\n1. Description of services\nPlaySignal is a website that provides the public with information, analysis and comparisons relating to sports betting odds, matches and predictions. The service includes typical features of this type of information platform.\nPlaySignal reserves the right to modify the service features at any time or to remove them when deemed appropriate. The Site may contain links to external content managed by third parties beyond our control. PlaySignal assumes no responsibility of any kind for content, information, products and services offered by sites accessible via external links.\n\n2. Informative nature of the service\nPlaySignal is a sports information service. It does not offer gambling or manage bets. In Ghana, gambling and betting are regulated by the Gaming Act 2006 (Act 721) and the National Lotto Act 2006 (Act 722), enforced by the Gaming Commission of Ghana. Gambling is prohibited for minors under 18 years of age. The information provided does not in any case constitute advice or recommendation of any nature. Use of the content and information available on PlaySignal is solely the responsibility of the user.\n\n3. Duration and use of the service\nThe service is provided without time limit. Given the free nature of the service, the user may terminate use at any time. PlaySignal reserves the right to suspend or close the service at any time, with or without notice.\nIn case of non-compliance with these terms or for any other legitimate reason, PlaySignal may suspend access to the service immediately and without prior notice.\n\n4. Limitation of liability\nInformation disseminated through the service is provided without any guarantee of reliability, accuracy or completeness. The service is provided \"as is\". PlaySignal cannot be held responsible for losses or damages arising from use of the Site, external links, technical malfunctions, force majeure or third-party actions.\n\n5. Personal data\nRegarding the processing of personal data, please refer to the Privacy Policy. The user has the right at any time to access, rectify and delete their data, by contacting customer service or the Data Protection Officer at the address indicated in the privacy policy.\n\n6. Permitted use\nOnly personal and non-commercial use of the service is permitted. It is prohibited to publish, reproduce or redistribute the contents of the Site without authorisation. The user undertakes not to publish illegal, defamatory, discriminatory content or content in violation of third-party rights.\n\n7. Modifications\nPlaySignal is free to modify these terms at any time. Continued use of the service after any modifications constitutes acceptance of the updated terms. We recommend consulting this page periodically.\n\n8. Applicable law\nThese terms are subject to Maltese law. For any dispute, the courts of Malta shall have jurisdiction, save for mandatory provisions in favour of the consumer.\n\n9. Responsible gambling\nGambling and betting can cause addiction. In Ghana, gambling is prohibited for minors under 18 years of age under the Gaming Act 2006 (Act 721). The Gaming Commission of Ghana regulates gaming and betting operations. In case of gambling-related problems, we recommend contacting the Gaming Commission of Ghana (gamingcommission.gov.gh) or visiting dedicated responsible gambling resources in your jurisdiction.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    },
    "privacy": {
      "linkName": "Privacy Policy",
      "title": "Privacy Policy",
      "fullText": "Last updated: February 2026\n\nThis Privacy Policy describes how East Side Ltd (hereinafter \"PlaySignal\", \"we\" or \"the Controller\") collects, uses and protects the personal data of users of the PlaySignal.io website. This Policy applies in addition to our Terms and Conditions.\n\nData Controller: East Side Ltd, 84 Luqa Briffa Street, Savoy Gardens Block D, GZR1503 Gzira, Malta. Registration: C74040, VAT: MT23084935.\n\nContacts: for requests regarding this document or our privacy practices, contact us at customercare@easyside.agency. For matters relating to personal data protection, you may contact the Data Protection Officer (DPO) at dpo@eastside.agency.\n\n1. How we collect information\n1.1 Information you provide to us\nWe may collect information from you directly, including personal data, if you choose to provide it. For example, when you subscribe to our newsletter or contact us for assistance, you may provide us with your name, email address or other contact details.\n\n1.2 Information collected automatically\nWhen you visit our site, we and our partners may automatically collect certain information using cookies, web beacons and similar technologies. The information collected may include: IP address, browser and device characteristics, navigation data (clickstream) and operating system information.\n\n2. Cookies and similar technologies\nCookies are text files that websites use to store information about users. We use different types of cookies:\n\n- Essential cookies: necessary for the site to function. They cannot be disabled.\n- Analytics cookies: help us understand how visitors use the site to improve our services.\n- Marketing cookies: used to show relevant ads and measure campaign effectiveness. They are only activated with your consent.\n\nYou can manage your cookie preferences at any time on the Cookie settings page. You can also configure your browser to block or delete cookies.\n\n3. Purposes and legal basis\nWe use your personal data for: (i) providing and improving our services; (ii) responding to your requests; (iii) sending communications (with your consent); (iv) analysing site usage for optimisations; (v) complying with legal obligations. The legal basis for processing is consent, contract performance or our legitimate interest, as the case may be.\n\n4. Data retention\nWe retain personal data only for as long as necessary for the purposes for which it was collected. In some cases we may retain it longer to comply with legal obligations. Data relating to cookie consent is retained according to the periods indicated in the cookie settings (12 months for Ghana).\n\n5. Your rights (Data Protection Act 2012)\nIn accordance with the Data Protection Act 2012 (Act 843) and the Data Protection Commission (DPC) of Ghana, you have the right to:\n\n- Access: obtain confirmation of the existence of data concerning you and receive a copy\n- Rectification: request correction of inaccurate or incomplete data\n- Erasure: request deletion of your personal data\n- Restriction: request restriction of processing in certain circumstances\n- Portability: receive data in a structured and transferable format\n- Object: object to processing on legitimate grounds\n- Withdraw consent: withdraw consent at any time (for consent-based processing)\n- Complain: lodge a complaint with the Data Protection Commission (DPC) at dataprotection.org.gh\n\nTo exercise your rights, contact us at customercare@easyside.agency or the DPO at dpo@eastside.agency. We will respond within the legal timeframes (generally 21 days under Act 843).\n\n6. Security\nWe adopt technical and organisational security measures to protect personal data from unauthorised access, loss, alteration or destruction. However, no transmission over the Internet can guarantee absolute security. If you have questions about data security, contact us.\n\n7. Links to third-party sites\nOur site may contain links to third-party websites. We are not responsible for the privacy practices or content of such sites. We invite you to consult their respective privacy policies before providing personal data.\n\n8. Modifications\nWe may update this Policy periodically. The date of the last update is indicated at the top. We recommend consulting this page regularly. In case of substantial changes, we will communicate the update appropriately.\n\nFor more information on how we manage cookies, visit the Cookie settings page.\n\nGambling is prohibited for minors under 18. Gambling can cause addiction."
    }
  }
}